Revit 2027 API
FamilyType.AsValueString Method
Provides access to value as a string with unit in the given family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsValueString(
	FamilyParameter familyParameter
)
Public Function AsValueString (
	familyParameter As FamilyParameter
) As String
public:
String^ AsValueString(
	FamilyParameter^ familyParameter
)
member AsValueString :
        familyParameter : FamilyParameter -> string
Parameters
familyParameter FamilyParameter
Return Value
String
The string that represents the parameter value with unit.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid.
Remarks
The method only applies to parameters of value types. If the parameter has no value or does not contain a numeric value, the method returns null.
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace